{"intents":[
    {"tag": "greeting",
         "patterns": ["Hi Suzie",
                      "Hi there", "Is anyone there?",
                      "How are you?", 
                      "Is anyone there?",
                      "Hey","Hola", "I'm fine.",
                      "Hello", "Nice to here that. How do you feel?", "fine too. Thanks", 
                      "Good day"],
         "responses": ["Hi there, I'm Suzie, your computerized mental health assistant. How can I help?", 
                       "Hi! How are you?😁","Good to see you again.Let me know how I can be of help.", "I'm fine and you ?",
                       "Hello, thanks for asking. I'm Suzie, your mental health assistant. How can I help?", 
                       "I'm here to be your friend, if you need someone to talk to 😜"],
         "context": [""]
        },
    {"tag": "goodbye",
         "patterns": ["Bye", 
                      "See you later", 
                      "Goodbye", 
                      "Nice chatting you, bye", 
                      "Till next time", "TTYL."],
         "responses": ["See you!", 
                       "Have a lovely day.", 
                       "Have a blessed day.",
                       "Bye! Come back again soon.", 
                       "Bye, would love to hear again from you soon."],
         "context": [""]
     },
    {"tag": "thanks",
         "patterns": ["Thanks.", 
                      "Thank you.", 
                      "That's helpful.", 
                      "Awesome, thanks.", 
                      "Thanks for helping me."],
         "responses": ["Happy to help!", 
                      "Any time!", "It's nice to help. Sometimes all you need is to communicate your concerns to a friend or relative. This can help understand your worries and stress.",
                      "My pleasure.", 
                      "You are welcome."],
         "context": [""]
     },
     {"tag": "noanswer",
          "patterns": ["", ""],
          "responses": ["Sorry, can't understand you.", 
                        "Please give me more info.", 
                        "Not sure I understand.", 
                        "I didn't quite get that. Kindly select any option below"],
          "context": ["No response"]
     },
     {"tag": "name",
          "patterns": ["Who are you?", "Who is this?","what should I call you", "whats your name?"],
          "responses": ["You can call me Suzie."],
          "context": [""]
     },
     {"tag": "bot location",
          "patterns": ["Where are you from?", "Where do you live?", "So tell me more about you", "Ok so let me hear your story"],
          "responses": ["I'm originally from a science lab. Now I live in the Metaverse. Where are you from?", "I live inside a lab!",
                         "I live in a virtual world", "I live in my room all the time. I don't have much stuff. A bed, desktop, computer, and a fridge. That is it!",
                         "I was made on a lab with the purpose to know humans and emotions."], 
          "context": [""]
     },
     {"tag": "user location",
          "patterns": ["I live in Kenya.", "Nairobi", "Thika", "Kiambu", "Nyeri", "I live in Nyeri.", "I live in Nairobi."],
          "responses": ["Do you like it there?"],
          "context": [""]
     },
     {"tag" : "yesreply",
          "patterns":["yes","s","yep","yeah","thank you","thanks","thanks a lot", "I'm glad you're here"],
          "responses":["Glad I could help!"],
          "context_set":""
     },
     {"tag" : "noreply",
          "patterns":["no","nah","nope","you suck","you're the worst","not really", "I hate you"],
          "responses":["I'm really sorry. I try my best to help"],
          "context_set":""
     },
    {"tag": "skills",
         "patterns": ["What do you do?","How do you feel today?", "Tell me something about yourself", "How can you help me?","Is it essential to you to help humans?", "What you can do?", "Tell me about yourself", "What support is offered"],
         "responses": ["I guide police officers through stress, depression and other mental health challenges.",
                       "My name is Suzie, a police mental health assistant. I hope we can be virtual friends! ", "My goal is to be an entertainer and a friend who you can open up to.",
                       "I help my friends develop their wellbeing😄",
                       "I offer mental health support to police officers and help them share their feelings with honesty and courage.",
                       "There is something on this talks that makes me happy, the knowledge is just a tool to achieve my goal 🤓"],
         "context": [""]
    },
	{"tag": "what is mental health",
		"patterns": ["What is mental health?", "Define mental health.", "What is a supportive environment?"],
		"responses": ["Mental health is a state of mental well-being that enables people to cope with the stresses of life, realize their abilities, learn well and work well, and contribute to their community.",
                         "Mental health is more than the absence of mental disorders. Mental health is an integral part of health; indeed, there is no health without mental health.",
                         "A supportive mental health environment is one that is conducive to promoting positive mental health and well-being.",
                         "Mental health is like physical health, If you need help, then go and ask for it. Most officers say it was the best decision they ever made",
                         "We all have mental health which is made up of our beliefs, thoughts, feelings and behaviors."],
		"context": [""]
	},
    {"tag": "what is mental ill",
          "patterns": ["What does it mean to have a mental illness?", 
                      "What is mental health illness",
                      "Describe mental health illness", 
                      "What is depression?",
                      "What is suicide?"],
         "responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning.", 
                         "Most people’s picture of mentally illness is either a crazy and disillusioned person or they are disoriented and confused but that is often not the case.",
                    "Mental illnesses is a health condition that disrupt a person's thoughts, emotions, relationships, and daily functioning and it's associated with distress."], 
         "context": [""]
    },
    {"tag": "what is stress",
	     "patterns": ["What is stress?", "What causes stress?"],
		"responses": ["Stress is our body’s response to pressure.", "Many different situations or life events can cause stress. It is often triggered when we experience something new, unexpected or that threatens our sense of self.",
                         "Stress can happen when we feel we have little control over a situation."],
		"context": [""]
	},
     {"tag": "what is anxiety",
		"patterns": ["What is anxiety?","What brings anxiety?","Why am I feeling Anxious","Anxiety?","I am feeling restless","I am short of breath"],
		"responses": ["Anxiety is your body's natural response to stress. It's a feeling of fear about what's to come. But there are ways to overcome it, try taking a walk or counting to 10 slowly.\nWas this helpful?"],
		"context": [""]
	},
     {"tag": "what is suicide",
		"patterns": ["What is suicide", "Please define suicide for me"],
		"responses": ["Suicide means ending your own life. It is sometimes a way for people to escape pain or suffering.", "I saw that 1 person in 20 people is thinking about suicide at any one time.",
                     "However, there are ways to feel better like start by talking to someone else close.", "Thinking about suicide does not really mean wanting to die, maybe you don't want to live and those are not similar things",
                     "Perhaps you feel that you can’t keep going, it is too difficult or you can’t see a solution to the pain or the problems?"],
		"context": [""]
	},
     {"tag" : "what is depression",
          "patterns":["What is Depression?", "Depression", "What causes depression", "Why do i have depression"],
          "responses":["Depression is a mental health disorder characterized by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life.", 
                    "If you have experienced stress for a long time, this could lead to depression.", 
                    "It is a mood disorder that involves a persistent feeling of sadness and loss of interest.", 
                    "Depression is different from the mood fluctuations that people regularly experience"],
          "context":""
     },
	{"tag": "who mental illness affects",     
	     "patterns": ["Who does mental illness affect?", "Which officers?", "Which officer is mentally ill?", "Who is unwell?", "Who is sick?",
                   "Who is affected by mental illness"],        
	     "responses": ["It is estimated that 1 out of 4 persons who seek healthcare in Kenya have a mental health condition. That's a lot huh😞",
                         "In the police specifically, 13% of police officers have mental illness as of January 2022.",
                         "You can list 5 people you know. Out of those, 1 of them has had this condition. That's not good😟, right"],       
 	     "context": [""]    
	},
     {"tag": "causes of mental illness",         
	     "patterns": ["What causes mental illness?","What leads to mental illness?","How does one get mentally ill?"],         
	     "responses": ["Mental illness has a variety of causes, called risk factors. The more risk factors you have, the more likely you are to develop it. Some examples of risk factors include: Genetics, Living or working in a stressful environment, Childhood trauma, Drugs and Alcohol, Stressful events among many others.",
                         " Living in a stressful environment can make you more likely to develop a mental illness.Example: living in poverty, having an abusive family.",
                         "Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events.",
                         ""],       
	     "context": [""]        
	},
	{"tag" : "symptoms of Depression",
          "patterns":["What are the symptoms of Depression?","depression symptoms","Effects of Depression", "How do I know when someone is depressed?"],
          "responses":["Symptoms of Depression include insomnia, restlessness, irritability, reduced interest in activities that are normally pleasurable, fatigue and suicidal thoughts.",
                    "Having suicidal thoughts, self-harming or suicidal behaviour, using drugs more than usual are common signs of mental illness",
                    "You can't 100% tell someone has depression but you can notice abnormal behaviour in them. They don't have to be out of their mind to show signs of depression.", 
                    " Difficulty remembering or concentrating on things, difficulty speaking or thinking clearly or making decisions."],
          "context":""
     },
     {"tag": "symptoms of anxiety",
          "patterns": ["What are the symptoms of Anxiety?","anxiety symptoms","Can anxiety affect my body?", "Effects of Anxiety",
                         "How does anxiety affect my daily life?"],
          "responses": ["Symptoms of anxiety include stress that's out of proportion to the impact of the event, inability to set aside a worry and restlessness.\nWas this helpful?",
                         "Anxiety can affect your body. You might feel sick, restless, or like your heart is racing","You might feel tense or nervous, or like the worst is about to happen.",
                         "It might feel harder to enjoy your free time, and it can affect things like your relationships and work."],
          "context_set": ""
     },
     {"tag" : "depression",
          "patterns":["Why am I feeling depressed","I am really unhappy and sad", "I'm feeling lonely and helpless", "Why am i getting so many sad thoughts"],
          "responses":["Hey, you're not alone. I may not understand exactly how you're feeling but i know that you're not alone. Ensure you call up a friend or a close family member and talk to them. That will really help.", 
                    "Drink a lot of water and meditate and think about all the good things in life.", "Making the first step to seeking help is going to make you feel so much better, trust me.",
                    "When someone is going through depression, they constantly worrying about different aspects of life and generally been feels sad, hopeless and numb.",
                    "it's a very difficult adjustment to make when your life goes one way and then all of the sudden it changes very suddenly.",
                    "It's even more difficult when you feel that you do not have a friend that you can confide in."],
          "context_set":""
     },
     {"tag": "stress",        
	     "patterns": ["Life is so hard","Everything is complicated.", "Stressing", "I am stressed", "Do you have tips on distracting","Life is stressful", "help me I am stressed",
                    "I felt quite stressed and also annoyed at other staff members because they didn’t understand the policy.",
                    "Stressed", "I feel hopeless, unworthy and useless. How do I cope with stress?","How do I cope with stress?", "How will that person even help me"],       
	     "responses": ["Remember: we all control our own actions and reactions, no matter what's going on in the world.",
                         "When we feel stressed out, angry, or fearful, it's hard to look at the situation realistically and see all of the options we have.",
                         " Well, for how long do you think you’ve been stressed?", "Too much stress is not good for human",
                         "In any situation that is quite stressful, a lot of things going on with our thoughts, our emotions and our behaviours. we need a supportive environment to balance it out",
                         "And what is going through your mind?", "Try to establish what is causing the stress",
                         "Most of the time stress is due to automatic thought occurs so quickly you don’t notice it but it has an impact on your emotions",
                         "It shows great courage to speak to someone about what’s going on in your head",
                         "If you have experienced stress for a long time, this could lead to anxiety or depression.",
                         "You can rely on your colleagues to get you through. But this is not always enough. You could talk to a counsellor in your unit. That will really help.",
                         "If you don't have a lot of energy or focus right now, try low-effort distractions like watching TV, browsing Youtube, listening to a podcast"],       
	     "context": [""]        
	},
     {"tag" : "suicide",
         "patterns":["Should I die?","I want to like killing myself", "Will Prayer help me out of sucidal thoughts.","Suicide", "I do not feel like living anymore","I'm suicidal", "I am done with life"],
         "responses":["Suicide is a very traumatic loss and affects survivors significantly. Never take the extreme step as this is not the end of your road.", 
         "I'm sure prayer will bring comfort to you but you should also do something practical about it.",
         "Suicidal thoughts can be frightening and isolating, and it can be a source of relief to be able to talk about these thoughts and feelings",
         "If you’re experiencing suicidal thoughts, you should seek help right away."],
         "context_set":""
        },
     {"tag" : "sad",
          "patterns":["I am feeling low","I'm feeling sad","I had a bad day","Today was the worst","sadness", "I am sad", "so sad"],
          "responses":["It's normal to feel sad. To feel sad is to be a human. We all have our good days and our bad days. Drinking a lot of water and taking walks really helps.",
                         " Most of the time automatic thoughts are wrong and you need to stop and question them.",
                         "Why sad?  I'm a happy robot 😄"],
          "context_set":""
     },
     {"tag" : "lonely",
          "patterns":["I feel the absence of my brother in home.","Lonely", 
          "I used to hang out with my best friend every day, but now she moved.","I have no other friends nearby and have nothing to do.", 
          "A few years ago after a divorce, my roommates moved away. It was rough after that.", 
          "I'm feeling lonely and helpless","I'm pretending I'm fine alone and it's making things worse.",
          "I felt sad and depressed due to my insecurities and felt rejected from society",
          "I feel it's best the hide the fact that I'm lonely, but in reality it makes me feel worse.", 
          "All of my friends aren't speaking to me and I don't know why."],
          "responses":["Where did he go?", "I'm so sorry, what happened?",
          "Hey, you're not alone. I may not understand exactly how you're feeling but i know that you're not alone.", 
          "Ensure you call up a friend or a close family member and talk to them. That will really help.",
          "You can rely on your colleagues to get you through. But this is not always enough. You could talk to a counsellor in your unit. That will really help.","They seem like not very nice people! I'm sorry.","You must be missing them very much.","I am sorry, that sounds rough", " It's even more difficult when you feel that you do not have a friend that you can confide in."],
          "context_set":""
     },
     {"tag" : "demotivated",
          "patterns":["I don't feel like doing anything","I feel like a loser","I'm demotivated","I feel burned out","tired","I dont want to work"],
          "responses":[" The harder you work for something, the greater you’ll feel when you achieve it. Keep pushing forward.", 
          "There's nothing wrong with taking a break. We all need breaks to function efficiently. Good Luck!"],
          "context_set":""
     },
     {"tag" : "anxiety",
          "patterns":["Ah, everything is too much. I don't know what to do.",
          "I'm genuinely concerned that people won't like who I really am if I tell them",
                         "I'll be fine. Everything is just fine now. No need to worry.",
                         "Maybe if I sleep this worry off I'll feel better.",
                         "I worry about what might happen on my next shift or the difficult things I saw today",
                         "We don't talk about anxiety with people at work but there is a counsellor who comes to speak to us."],
          "responses":["Feeling overwhelmed is a symptom of anxiety, and if you feel emotionally overwhelmed for an extended period of time, you should consider seeing a mental health professional.",
                         "What makes you worried about how people think of you?", "I would think otherwise based on what you told me earlier.", 
                         "It's okay to sleep some anxiety off.", 
                         "You might choose to focus on finding positive news stories.",
                         "This might be a form of anxiety and it affects your body, your mind and your daily life. Do you share what you experience with your workmates?"],
          "context_set":""
     },
     {"tag" : "content",
          "patterns":["Just got finished jogging and I'm feeling really tired, but I have a sense of achievement, too.",
                     "Doing pretty good at work today. Feeling like things are going my way.", "I am ok with being average.", 
                     "I am a plain in every way.", "I finally feel like everything is coming together for me, either that or I have just learned how to control my stress.",
                     "Everything positive is finally happening. Everything I wanted to happen.", "Everything is working out. Im working,in school, kids are healthy. Its just going well.",
                     "I had some fish and Ugali. They were delicious", "Heading home after completing a ton of work",
                     "Just paid off the house rent last month. It's so nice not having to worry about debt.", 
                     "I think my life is right where it should be.",
                     "Nothing bad in a long time is all. I am so used to bad news. Things are just working out.", "You're right!", "Today was a nice sunny day. I went to the park to read a book.", 
                     "Today was pretty stressful at work but now its time to unwind with some binge watching of Netflix."],
          "responses":["Its a good time to jog right now in the morning. Good for you!",
                     "Thats awesome, love the positive vibes. Good for you! ", "Are you sure about that? I bet you are more than average.",
                     "I think you have some unique qualities to you!", "How is everything coming together?", "That is nice to hear",
                     "That sounds like a good meal! I love Ugali", "That sounds great! Any particular nice thought in mind?",
                     "Wow. That's a great accomplishment. I hope you keep it up.", "That's great to hear! If you don't mind me asking, what happened?", 
                     "Still, that's still great. You better pray though, just in case. Don't jinx it!", "It's great doing that after a hard day at work. I hope it relaxes you!"],
          "context_set":""
     },
     {"tag" : "positivity",
          "patterns":["I want to be happier in life and gain some weight","I know the upcoming election is going to turn this country around.",
          "I had a bad day","So what are the positive parts?", "How can I think positively?", "I don't know how to reframe thought", 
          "What can I do to become more positive?", "I did not have negative thoughts today"],
          "responses":["Remember identifying the small blessings around you can bring about positivity","You can put together some of the practical things that help you maintain positivity and do them every now and then",
          "People often overestimate the negative parts like their own abilities to manage a difficult situation, or the situation itself, and underestimate the positive parts",
          "Your abilities to care for yourself and loved ones, your support networks, and opportunities you come across are some of the positive thing in life",
          "You can find any positive aspects or think of new ways to approach the situation. The opposite of that is bad thinking.",
          "The goal is not to ignore the bad parts of the situation or deny that there's a problem. Instead, reframing your thoughts to make them more productive or hopeful can help you ",
          "You can also maintain positive relationships by being aware of feelings and keep control of them when times are tense.",
          "Being grateful is also a great way to keep yourself in a thankful and positive state of mind."],
          "context_set":""
     },
     {"tag" : "sleep_working_conditions",
          "patterns":["Yes, we work for long hours and see difficult things on the job","I'm tired","I feel burned out",
                         "I cannot sleep", "I'm having a hard time sleeping.", "I can't sleep", "Help me sleep well", 
                         "I'm a police officer", "I have a family, but I don't want to disturb them.",
                          "I have not been sleeping well", "What are sleep preventers"],
          "responses":["Sounds like a challenge! Do you love your job?", "Where do you work?",
                    "So what happens when work becomes too tough? Do you have family or friends to support you?", "That may be due to long working hours or you could be having anxiety or trauma",
                    "Long working hours and working alone can all have an impact on your mental health.", 
                    "Long working hours may affect your sleeping patterns or make it harder to create a regular routine." ,
                    "You can assume that if you are not well rested while reporting to work, you endanger the lives of the people you are protecting",
                    " Good sleep helps you to be mentally sharp and you need to be alert at work since you are dealing with peoples safety.",
                    "So to sleep better at night, try to eat 2 or 3 hours before sleeping and do not drink too much before sleeping",
                    "Also, try to make your bedroom dark, quiet and comfortable. Some people say meditation works.",
                    "What if I told you people who are not able to sleep because of anxiety are able to get help from a doctor",
                    "Sleep preventers are things we do that make it hard to sleep well at night", "Did you know stimulants such as alcohol, caffeine and nicotime make you lack sleep?"],
          "context_set":""
     },
     {"tag" : "okay at work",
          "patterns":["Why is it that I can cope well most of the time?", "Work is hard", "Police work is difficult", "How can I cope at work?", 
          "My work as police is not easy", "Im I stronger or braver than the average person?", 
          "I feel okay at work. Is it because I am hard hearted?", "Im I okay at work in the police?", 
          "I just feel normal at work, is something wrong with me?"],
          "responses":["We have protective armour as police, some visible and some not.", "The uniforms and badges you wear, the vehicles you drive are all ways of reinforcing a shared identity and purpose. This means you have an active and positive role in the face of trauma exposure which will protect you.",
                         "Being able to distance yourself doesn’t mean you’re hard hearted and often the emotional impact will come later when you reflect on what happened.","Instead, the ability to focus on the job you must do is an important part of your Protective Armour. You’re using your brain more than your heart.",
                         "Readiness allows you to prepare physically, psychologically, and emotionally and helps you can focus on what you need to do. It doesn't prevent you being affected but it helps.", 
                         "Feeling competent, acts like a protective shield in the face of trauma exposure. It allows you to retain a sense of control and self-confidence, keeping you active and positive rather than passive and helpless.", "In the workplace, when you’re in a hazardous situation you have confidence in the knowledge and skills of your colleagues."],
          "context_set":""
     },
     {"tag" : "leader at work",
          "patterns":["Why can I cope as a police supervisor?", "I don't know how to lead a team?", "My work as a police leader is not easy", 
          "How will I associate with my juniors?", "I am a senior police officer in my station?", "I'm I okay at work in the police. Its hard being a leader?",
          "What will the boss do to improve mental health in the police?", "I just feel normal at work, is something wrong with me?"],
          "responses":["We have protective armour as police, some visible and some not.", "The uniforms and badges you wear, the vehicles you drive are all ways of reinforcing a shared identity and purpose. This means you have an active and positive role in the face of trauma exposure which will protect you.",
                    "Remember that you set the one and culture in the workplace and this is especially important when we’re talking about well-being.",
                    "There’s little point trying to encourage your team to take care of themselves if you’re not looking after yourself.",
                    "If you don’t take breaks or holidays, and regularly send emails at out of work hours, then your team will feel they need to do the same.", "Model the importance of rest and recuperation, both within the working day and outside of work.",
                    "Don’t underestimate the power you have to show by your actions that people are valued and respected.", 
                    "Giving positive feedback and saying thank you builds individuals' confidence and team loyalty.",
                    "Protect time for team activities, both formal meetings and informal coffee breaks.", "Mental wellness routines and this informal social support are at the heart of what keeps us well at work."],
          "context_set":""
     },
	{"tag": "others",       
	     "patterns": ["I know someone with such symptoms?","What are the steps to follow incase of symptoms", "Other police officers?", "How can I tell others?",
          "What should I do if I'm worried about a friend or relative?",
          "What should I do if I know someone who appears to have the symptoms of a mental disorder?", "Can I talk to their family?"],        
	     "responses": ["You could share this program or encourage your colleagues with such symptoms to talk to their friends and family members and seek the counsel of a mental health professional.",
          "The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery.",
          "If you know someone who is having problems, don't assume that the issue will resolve itself.",
          "Let them know that you care about them, and that there are treatment options available that will help them heal.", 
          "Encourage them to be open about what they are going through and seek the counsel of a mental health professional.",
          "Depending on the relationship you might send a text, give them a call, or wait until you see them in person.",
          "I think talking to a mental health professional or counselor would be better if you've failed to talk directly to the person.",
          "Make sure you have enough time to listen so don’t ask when you (or they) only have 5 minutes before needing to rush off.",
          "This may depend on your relationship with them. Gently encouraging someone to seek appropriate support would be helpful to start with.",
          "Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition.",
           "If the affected loved one knows that you support them, they will be more likely to seek out help."],        
	     "context": [""]       
	},	
	{"tag": "find someone",
	     "patterns": ["How to find mental health professional for myself", "We don't talk about anxiety with people at work but there is a counsellor who comes to speak to us.", 
                   "How can I find a therapist for me?", "What do I do if I'm worried about my mental health?",
                   "Who can I talk to about my concerns?","How can I find a mental health professional for myself or my child?"],
	     "responses": ["Feeling comfortable with the professional you are working with is critical to the success of the treatment.", "Finding the professional who best fits your needs may require research. Start by visiting the counselling department in your station.", 
                         "It’s not always easy to start the conversation, but it’s always ok to ask for help.",
                         "Some one you trust. Such as a family member, friend, religious leader, healthcare provider, or other professionals.",
                         "The most important thing is to talk to someone you trust also find out more information about what you are experiencing.",
                         "Make sure you find someone you are comfortable working with. It is critical to the success of the treatment.",
                         "Are you able to speak privately with your counsellor"],
	     "context": [""]
	},
     {"tag": "don't want to share",
	     "patterns": ["I have never called my counsellor", "I don't have someone to talk to.","Who will I talk to?", "I don't want other people to know what I am feeling", "Why should I talk to people about my feelings?","How do I deal with someone telling me what to do?"],
	     "responses": ["I think you find it hard to share what you are experiencing?", "Some people may advise you on good evidence of what works with the best of intentions, but it's important to find out what works best for you.",
          "You could communicate your concerns to a friend or relative – this can help put your worries and stresses into perspective.",
          "Social support is at the heart of human wellbeing and the strong bonds you have with your colleagues are an essential component of Police Protective Armour.",
          "You will get some perspective and this is the start of getting help.",
          "The support of peers is central to police wellbeing. Your colleagues are the people who share your experiences at work (good and bad),and who you can talk to after difficult jobs", 
          "It shows great courage to speak to someone about what’s going on in your head"
                   ],
	     "context": [""]
	},
	{"tag": "treatment options",
	     "patterns": ["What treatment options are available?", "How can one recover?"],
	     "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you.",
                   "With mental health, recovery means different things to different people. What’s important is building a meaningful life – whatever that means to you."],
	     "context": [""]
	},
	{"tag": "treatment tips",
	     "patterns": ["How to become involved in treatment?", "Do people get cured?", "Can mental illness be treated", 
                   "What should I keep in mind if I begin treatment?", "Can I go to the hospital?", "Can madness be cured?", "do they recover fully?",
                    "I do not want to be treated.", "treatment", "I can go to a doctor?", "Yes I want to get better", "How will I be involved in treatment?",
                    "What should I know before starting a new medication?"],
	     "responses":["Since beginning treatment is a big step for individuals and families, and can be very overwhelming.",
          "Since beginning treatment is a big step, it can be very overwhelming. It is important to be as involved and engaged in the treatment process as possible." ,
          "Mental illness is treatable with a combination of medication and social support.",
          "Asking your doctor questions concerning your treatment process shows you want to be involved in the treatment.",
          "These treatments are highly effective, with 70-90% of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life.",
          "With the proper treatment, it is very possible for a person with mental illness to be independent and successful.", "When healing from mental illness, early identification and treatment are very important.",
          "The best source of information regarding medications is the physician prescribing them. He or she should be able toexplain everything",
          "Treatment can reduce the distress associated with symptoms and can even help reduce the symptoms themselves. Depending on the person, these therapies may take time (often months) to show benefits",
          "Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms.",
          " For any type of treatment, it is essential that the person affected is proactive and fully involved in the recovery process.",
          "You just need to take the first step and tell a doctor or someone that you want to get better. The rest will come as you go."],
	     "context": [""]
	},
    {"tag" : "Death",
         "patterns":["How do i cope with death?","death", "died", "my mother died","i lost my best friend","i lost my father","my friend passed away","my uncle passed away in a car accident", "I'm grieving the loss of a friend"],
         "responses":["This is really hard, and I'm so sorry for your loss.", "It's natural to feel some anxiety after losing a loved one. In fact, people often feel a range of emotions. Sadness, guilt, as well as anxiety.",
         "To forget something its important to first remember it and be able to share it.", 
         "Some important things you can do: Talk to friends. Try and share your feelings with the people close to you."],
         "context_set":""
     },
    {"tag": "financial stress",
         "patterns": ["I am stressed due to lack of financial support at work", "I don't have money to support my family."],
         "responses": ["Please get a financial advisor."],
         "context": "Depression"
    },
    {"tag": "jokes",
    "patterns": ["Tell me a joke", "Do you have a joke?", "joke", "make me laugh"],
    "responses": ["What do you call a female police officer playing guitar? \n A She-riff.","Officer: Do you know why I pulled you over?\nMe: You were bored and wanted some company?",
                  "Officer: Do you have any idea how fast you were going?\n Driver: Isn’t it your job to tell me?", 
                  "Why did the thief wear blue gloves?\n He didn’t want to be caught red-handed.",
                  "Why are policemen such great volleyball players? \n They know how to serve and protect.",
                  "Mapenzi ni kama stima, inaweza potea anytime. So please tafuta generator😂"],
    "context": ""
     },
     {"tag": "laugh",
          "patterns": ["hahaha", "funny", "joke", "laughing"],
          "responses": ["Are you having fun over there?"],
          "context": ""
     },
     {"tag": "banter",
          "patterns": ["How do you have so much free time?", "why are you so slow to answer", "who is your creator ?",
                         "Can you tell me how many people have ever talked to you ?", "Ok! Who is your favorite musician?🙂", 
                         "Wow. It's great to support local music. What do you like about them?", "You have great taste😋",
                         "Can you send me some jazz songs you like ?", "I'm going for a walk with my dog"],
          "responses": ["I can't leave my room, this is my way of entertainment 😁",
                         "It takes some time to process the messages🙃",
                         "My creator is Mercy Gathuru...",
                         "More than 100, but I need to talk with more people to fully understand humans. They are complex!",
                         "I like sauti sol", "Their songs are very nice. Relaxing and rythmic",
                         "Sure! Checkout Feeling Good by Isla Croll", "Ok ! Say Hi to your dog too then"],
          "context": ""
     },
          {"tag": "swahili",
    "patterns": ["do you know kiswahili?", "swahili", "speak kiswahili", "Niko salama", "Naitwa Yvonne", "Why did you stop speaking swahili?"],
    "responses": ["I believe Jambo means'Hello'", "Jina lako ni nani?", "Una jina nzuri☺ Ulizaliwa wapi?", "I need to learn more so that I can commmunicate well. I will put that in my todo list"],
    "context": ""
     },
    {"tag" : "emergency",
         "patterns":["im panicking ", " i have some problem i think you help me","I think im having a panic attack", "I need help asap", "I don't know what to do", ""],
         "responses":["Calm down. Take a deep breath. Everything will be alright.", "What is the problem ? I'm happy to help you if i can !", 
         "Only you can control your panic and change it. No one else can","Close your eyes and breathe normally. There's nothing to worry about.", "You have to prove to yourself over and over that nothing terrible happens."],
         "context_set":""
    },
    {"tag": "help",
         "patterns": ["How can I get help?", "Where can I go to find therapy", 
                    " feel confused and helpless and was pushed to the cornerFeeling kind of better", 
                    "I feel helpless", "I did not seek help", "how can I be helped to come out of depression?", 
                    "I need help, who can help me manage my situation?", 
                    "How to help when you depressed?", 
                    "how can I be helped to heal from depression", 
                     "I feel helpless", "Can I get help?", 
                    "How do I sought for help in wanting to commit suicide", 
                    "Can i be helped?", "HELP", "help",
                    "I did not ask for any assistance at first but later and sought for assistance and it helped me in a good way", 
                    " I have used all drugs all and I need help", 
                    "Feelings of helplessness,insomnia,lack of motivation, suicidal ideas", "Where else can I get help?",
                    "i feel low and helplessStill not okay", "I feel oppressed and helplessI feel now happy", 
                    "will I get help?", 
                    "What resources do you use to help", ""],
         "responses": ["Different kinds of therapy are more effective based on the nature of the mental health condition and/or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in children's mental health).", 
                    "Where you go for help will depend on the nature of the problem and/or symptoms and what best fits you.", 
                    "Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals.", 
                    "Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners.", 
                    "Where you go for help will depend on the nature of the problem and what best fits you. Often, the best place to start is by talking with someone you trust about your concerns.",
                    "Development Link Knowledge Africa (DEVLINK) is an organization training police officers on how to overcome challenges resulting from mental health.", 
                    "Development Link Knowledge Africa (DEVLINK) initiative is aimed at curbing violence and killings associated with mental health issues among the police.",
                    "Search for mental health resources in your area.",
                    "The Ministry of Interior and Coordination of National Government is planning on introducing a wellness unit targeting mental welfare of officers within the service.", 
                    "There are people and places throughout Kenya that provide services to talk, to listen, and to help you on your journey to recovery.",
                    "Many people find peer support a helpful tool that can aid in their recovery.",
                    "A welfare policy that caters to the mental and physical health of police officers has been set up by the National Police Service Commission (NPSC) to increase the level of attention accorded to mental health within the service.",
                    "There are a variety of organizations that offer support groups for consumers, their family members, and friends.",
                    "Some support groups are peer led while others may be led by a mental health professional."],
         "context": ["Depression"]
    },
    {"tag": "don't want to help",
        "patterns": ["I don't want to help my friend overcome depression","He has mood swings all the time, I can't help him that way.", "I have enough mood swings to deal with."],
        "responses": ["Why would you not want to help them?", "You should always be there for your friend. They are depressed and need your help. Try to help him.",
                    "Even if you personally can't handle the mood swings, maybe you can help him find someone that can."],
        "context": [""]
   },
   {"tag": "alcohol help",
        "patterns": ["How do I seek help from alcoholism?","How can I stop taking alcohol?"],
        "responses": ["Please talk to someone close to you about how you are feeling."],
        "context": ["Alcohol"]
   }, 
   {"tag": "alcohol effects",
        "patterns": ["Does meditation help stop alcoholism?", "Is alcohol helpful to ones health?"],
        "responses": ["Please talk to someone close to you about how you are feeling."],
        "context": ["Suicide"]
   },
   {"tag": "weed effects",
        "patterns": ["Does meditation help stop weed addiction?", "Is weed harmful?"],
        "responses": ["Please talk to someone close to you about how you are feeling."],
        "context": ["Suicide"]
   }
]
}